CMS/XMLApiRequests/SendBankResponseCard.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <ImportTransIntegration xmlns="urn:microsoft-dynamics-schemas/codeunit/LS_Item_Price">
            <importWebSiteData>
                <Loyaltycustomer xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <customerEntryno>241281428542</customerEntryno>
                    <customerNo>  971 971 213222</customerNo>
                    <customerContactno>  971 971 213222</customerContactno>
                    <customerMobileno>  971 971 213222</customerMobileno>
                    <customerLoyaltycustomer></customerLoyaltycustomer>
                    <customerClubcode>SINYAR P</customerClubcode>
                    <customerSchemecode>FITNESS</customerSchemecode>
                    <customerName>Ahmed Moon</customerName>
                    <customerName2></customerName2>
                    <customerAddress></customerAddress>
                    <customerAddress2></customerAddress2>
                    <customerCity></customerCity>
                    <customerCountry></customerCountry>
                    <customerPhoneno></customerPhoneno>
                    <customerEmail>rajamooon.rm@gmail.com</customerEmail>
                    <customerPostcode></customerPostcode>
                </Loyaltycustomer>
                <TransactionHeader xmlns="urn:microsoft-dynamics-nav/xmlports/x50004">
                    <headerReceiptNo>WR241281428542</headerReceiptNo>
                    <headerStoreNo>S1001</headerStoreNo>
                    <headerTansactionDate>2021-08-06</headerTansactionDate>
                    <headerTransactionTime>18:44:26</headerTransactionTime>
                    <headerOriginialDate>06/08/2021</headerOriginialDate>
                    <headerNoOfItem>1</headerNoOfItem>
                    <headerNoofItemLines></headerNoofItemLines>
                    <headerMembeCardNo>  971 971 213222</headerMembeCardNo>
                    <headerCustomerNo></headerCustomerNo>
                    <headerNetAmount>499</headerNetAmount>
                    <headerVATAmount></headerVATAmount>
                    <headerGrossAmount>499</headerGrossAmount>
                    <headerDiscountAmount></headerDiscountAmount>
                    <headerTenderType>Online Payment</headerTenderType>
                    <headerPaymentAmount>499</headerPaymentAmount>
					<headerNetPrice>499</headerNetPrice>
                    <TransactionLine>
	<lineReceiptNo>WR241281428542</lineReceiptNo>
	<lineTransDate>2021-08-06</lineTransDate>
	<lineTransTime>18:44:24</lineTransTime>
	<lineNo>10000</lineNo>
	<lineStoreNo>S1001</lineStoreNo>
	<lineTicketNo>0000010</lineTicketNo>
	<lineTicketExpiryDate></lineTicketExpiryDate>
    <lineTicketActivateDate></lineTicketActivateDate>
	<lineItemNo>36</lineItemNo>
	<lineItemdescription></lineItemdescription>
	<lineExpirationdate></lineExpirationdate>
	<lineQuantity>1</lineQuantity>
	<lineUnitPrice>499</lineUnitPrice>
	<lineVATCode></lineVATCode>
	<lineVATPercentage></lineVATPercentage>
	<lineVatAmount></lineVatAmount>
	<lineNetAmount>499</lineNetAmount>
	<lineDiscountPercent></lineDiscountPercent>
	<lineDiscountAmount></lineDiscountAmount>
	<lineAmount>499</lineAmount>
</TransactionLine>


                </TransactionHeader>
            </importWebSiteData>
        </ImportTransIntegration>
    </Body>
</Envelope>